In [1]:
# dataframe - rows * cols 
import pandas as pd

In [2]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [3]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [4]:
pd.DataFrame([1,2,3])

   0
0  1
1  2
2  3

In [5]:
pd.DataFrame({'Monday' : 45,'Tuesday':30,'Sunday':1200},index=[1])

   Monday  Tuesday  Sunday
1      45       30    1200

In [6]:

s=pd.Series({'Monday' : 45,'Tuesday':30,'Sunday':1200})

pd.DataFrame(s)

            0
Monday     45
Tuesday    30
Sunday   1200

In [7]:
# TV 

customers={
    
    'Japan':pd.Series([300,450,290,345]),
    'Taiwan':pd.Series([160,145,192,210]),
    'Singapore':pd.Series([567,345,234,199]),
   
    
}

df=pd.DataFrame(customers)
df

   Japan  Taiwan  Singapore
0    300     160        567
1    450     145        345
2    290     192        234
3    345     210        199

In [8]:
df['Taiwan']

0    160
1    145
2    192
3    210
Name: Taiwan, dtype: int64

In [9]:
df[['Taiwan','Japan']]

   Taiwan  Japan
0     160    300
1     145    450
2     192    290
3     210    345

In [19]:
# row level= iloc[] loc[]


df.iloc[2:3]  # index 3 - row 4  [start value and stop index]
df.loc[2:3] # start index - inlude 3

   Japan  Taiwan  Singapore
2    290     192        234
3    345     210        199

In [23]:
df.iloc[[1,3]]

df.loc[[1,3]]



# iloc and loc - pass one number 
#                pass range 
#                pass index numbers []

   Japan  Taiwan  Singapore
1    450     145        345
3    345     210        199